package Stepic.Array;
///N кеглей выставили в один ряд, занумеровав их слева направо числами от 1 до N.
// Затем по этому ряду бросили K шаров, при этом i-й шар сбил все кегли с номерами от a до b включительно.
// Определите, какие кегли остались стоять на месте.
//Входные данные
//Программа получает на вход количество кеглей N и количество бросков K.
// Далее идет K пар чисел a, b , при этом 1abN.
//Выходные данные
//Программа должна вывести последовательность из N символов, где j-й символ есть “I”,
// если j-я кегля осталась стоять, или “.”, если j-я кегля была сбита.

public class Kegelban {
    public static void main(String[] args) {

    }
}
