package Stepic.For.Two;
//Напишите программу, которая выводит в столбик целые числа от 50 до 0  с шагом 10.


public class Down {
    public static void main(String[] args) {

        for (int i = 50;i>=0;i-=10){
            System.out.println(i);

        }
    }
}
