package Stepic.For.Two;
//Напишите программу, которая выводит на экран слово "Привет" (без кавычек) 10 раз.

public class TenTimes {
    public static void main(String[] args) {
        for (int i = 0;i<10;i++){
            System.out.println("Привет");
        }
    }
}
