package Stepic.For.Two;

//Составьте программу, которая в одну строку через пробел выводит все нечетные цифры.

public class UnCount {
    public static void main(String[] args) {
        for (int i = 1;true;i+=2){
                System.out.print(i);
        }
    }
}
